olliw42/stm32ll-lib/src/stdstm32-uartc.h
#elif defined UARTC_USE_UART2 || defined UARTC_USE_UART2_PA2PA3 || defined UARTC_USE_UART2_PD5PD6 || \
      defined UARTC_USE_UART2_PB3PB4 || defined UARTC_USE_UART2_PA14PA15 || defined UARTC_USE_UART2_PB3PA15 || \
      defined UARTC_USE_UART2_PA5PA15
  #define UARTC_UARTx             USART2
  #ifdef UARTC_USE_UART2
    // user needs to specify UARTC_USE_TX_IO, UARTC_USE_RX_IO, and possibly UARTC_USE_IO_AF
  #elif defined UARTC_USE_UART2_PA2PA3
    #define UARTC_TX_IO           IO_PA2
    #define UARTC_RX_IO           IO_PA3
  #elif defined UARTC_USE_UART2_PD5PD6 // was UART2_REMAPPED
    #define UARTC_TX_IO           IO_PD5
    #define UARTC_RX_IO           IO_PD6
  #elif defined UARTC_USE_UART2_PB3PB4 // only G4 // was UART2_REMAPPED2
    #define UARTC_TX_IO           IO_PB3
    #define UARTC_RX_IO           IO_PB4
  #elif defined UARTC_USE_UART2_PA14PA15 // only G4, F0 // ATTENTION: on G4 PA14 overlaps with SWCLK // was UART2_REMAPPED3
    #define UARTC_TX_IO           IO_PA14
    #define UARTC_RX_IO           IO_PA15
  #elif defined UARTC_USE_UART2_PB3PA15 // only G4
    #define UARTC_TX_IO           IO_PB3
    #define UARTC_RX_IO           IO_PA15
  #elif defined UARTC_USE_UART2_PA5PA15 // only H5, the AN2606 bootloader pair
    #define UARTC_TX_IO           IO_PA5
    #define UARTC_RX_IO           IO_PA15
  #endif
  #ifndef STM32F0
    #define UARTC_IO_AF           IO_AF_7
  #else
    #if defined UARTC_USE_UART2
      // user needs to specify UARTC_USE_IO_AF
    #elif defined UARTC_USE_UART2_PA2PA3 || defined UARTC_USE_UART2_PA14PA15
      #define UARTC_IO_AF         IO_AF_1
    #else
      #error UARTC_USE_UART2 mapping not available on STM32F0 !
    #endif
  #endif
  #define UARTC_IRQn              USART2_IRQn
  #define UARTC_IRQHandler        USART2_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
  #elif defined STM32WL
  #elif defined STM32H5
    // H5: PA2/PA3 is AF7 as set above on both lines, everything else differs
    #if defined STM32H5_H56x
      // H56x has USART2 only on PA2/PA3 and PD5/PD6, and PD5/PD6 is not bonded
      #if defined UARTC_USE_UART2_PD5PD6
        #error UARTC_USE_UART2_PD5PD6 not bonded on STM32H56x packages up to LQFP64 ! use UARTC_USE_UART2_PA2PA3
      #elif defined UARTC_USE_UART2_PA5PA15 || defined UARTC_USE_UART2_PB3PB4 || \
            defined UARTC_USE_UART2_PA14PA15 || defined UARTC_USE_UART2_PB3PA15
        #error UARTC_USE_UART2 mapping not available on STM32H56x ! use UARTC_USE_UART2_PA2PA3
      #endif
    #else
      // H503, the other mappings use different AFs
      #if defined UARTC_USE_UART2_PB3PB4
        #undef UARTC_IO_AF
        #define UARTC_IO_AF       IO_AF_13
      #elif defined UARTC_USE_UART2_PA14PA15
        #undef UARTC_IO_AF
        #define UARTC_IO_AF       IO_AF_9 // ATTENTION: PA14 overlaps with SWCLK
      #elif defined UARTC_USE_UART2_PA5PA15
        #undef UARTC_IO_AF
        #define UARTC_IO_AF       IO_AF_9
      #elif defined UARTC_USE_UART2_PD5PD6
        #error UARTC_USE_UART2_PD5PD6 not available on STM32H503 !
      #elif defined UARTC_USE_UART2_PB3PA15
        #error UARTC_USE_UART2_PB3PA15 not available on STM32H503 !
      #endif
    #endif
  #endif

#elif defined UARTC_USE_UART3 || defined UARTC_USE_UART3_PB10PB11 || defined UARTC_USE_UART3_PC10PC11 || defined UARTC_USE_UART3_PB8PB9 || \
      defined UARTC_USE_UART3_PA4PA3 || defined UARTC_USE_UART3_PB3PB8
  #define UARTC_UARTx             USART3
  #if defined UARTC_USE_UART3
    // user needs to specify UARTC_USE_TX_IO, UARTC_USE_RX_IO, and possibly UARTC_USE_IO_AF
  #elif defined UARTC_USE_UART3_PB10PB11
    #define UARTC_TX_IO           IO_PB10
    #define UARTC_RX_IO           IO_PB11
  #elif defined UARTC_USE_UART3_PC10PC11 // was UART3_REMAPPED
    #define UARTC_TX_IO           IO_PC10
    #define UARTC_RX_IO           IO_PC11
  #elif defined UARTC_USE_UART3_PB8PB9 // only F3
    #define UARTC_TX_IO           IO_PB8
    #define UARTC_RX_IO           IO_PB9
  #elif defined UARTC_USE_UART3_PA4PA3 // only H5
    #define UARTC_TX_IO           IO_PA4
    #define UARTC_RX_IO           IO_PA3
  #elif defined UARTC_USE_UART3_PB3PB8 // only H5
    #define UARTC_TX_IO           IO_PB3
    #define UARTC_RX_IO           IO_PB8
  #else
  #endif
  #ifndef STM32F0
    #define UARTC_IO_AF           IO_AF_7
  #else
    #if defined UARTC_USE_UART3
      // user needs to specify UARTC_USE_IO_AF
    #elif defined defined UARTC_USE_UART3_PB10PB11 || defined UARTC_USE_UART3_PB8PB9
      #define UARTC_IO_AF         IO_AF_4
    #elif defined UARTC_USE_UART3_PC10PC11
      #define UARTC_IO_AF         IO_AF_1
    #else
      #error UARTC_USE_UART3 mapping not available on STM32F0 !
    #endif
  #endif
  #define UARTC_IRQn              USART3_IRQn
  #define UARTC_IRQHandler        USART3_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
  #elif defined STM32WL
    #error UART3 NOT AVAILABLE !
  #elif defined STM32F0
    #undef UARTC_IRQn
    #undef UARTC_IRQHandler
    #define UARTC_IRQn            USART3_4_IRQn
    #define UARTC_IRQHandler      USART3_4_IRQHandler
  #elif defined STM32H5
    #if defined STM32H5_H56x
      // H56x USART3 is AF7 as set above, and only PC10/PC11 is bonded up to LQFP64
      #if defined UARTC_USE_UART3_PB10PB11
        #error UARTC_USE_UART3_PB10PB11 not bonded on STM32H56x packages up to LQFP64, PB11 is missing ! use UARTC_USE_UART3_PC10PC11
      #elif defined UARTC_USE_UART3_PB8PB9
        #error UARTC_USE_UART3_PB8PB9 not bonded on STM32H56x packages up to LQFP64, PB9 is missing ! use UARTC_USE_UART3_PC10PC11
      #elif defined UARTC_USE_UART3_PA4PA3 || defined UARTC_USE_UART3_PB3PB8
        #error UARTC_USE_UART3 mapping not available on STM32H56x ! use UARTC_USE_UART3_PC10PC11
      #endif
    #else
      // H503 USART3 is AF13 for the mappings reachable on the 48 pin package.
      // PB11 and PB9 do not exist on H503, and PC10/PC11 are not bonded on LQFP48.
      #if defined UARTC_USE_UART3_PA4PA3 || defined UARTC_USE_UART3_PB3PB8
        #undef UARTC_IO_AF
        #define UARTC_IO_AF       IO_AF_13
      #elif defined UARTC_USE_UART3_PB10PB11
        #error UARTC_USE_UART3_PB10PB11 not available on STM32H503, PB11 does not exist ! use UARTC_USE_UART3_PA4PA3 or UARTC_USE_UART3_PB3PB8
      #elif defined UARTC_USE_UART3_PB8PB9
        #error UARTC_USE_UART3_PB8PB9 not available on STM32H503, PB9 does not exist ! use UARTC_USE_UART3_PB3PB8
      #elif defined UARTC_USE_UART3_PC10PC11
        #error UARTC_USE_UART3_PC10PC11 not available on STM32H503 LQFP48, port C is not bonded !
      #endif
    #endif
  #endif

