olliw42/stm32ll-lib/src/stdstm32-uartc.h
#elif defined UARTC_USE_UART4 || defined UARTC_USE_UART4_PC10PC11 || defined UARTC_USE_UART4_PA0PA1
  #define UARTC_UARTx             UART4
  #ifdef UARTC_USE_UART4
    // user needs to specify UARTC_USE_TX_IO, UARTC_USE_RX_IO, and possibly UARTC_USE_IO_AF
  #elif defined UARTC_USE_UART4_PC10PC11
    #define UARTC_TX_IO           IO_PC10
    #define UARTC_RX_IO           IO_PC11
  #elif defined UARTC_USE_UART4_PA0PA1 // only F7, H56x // was UART4_REMAPPED
    #define UARTC_TX_IO           IO_PA0
    #define UARTC_RX_IO           IO_PA1
  #endif
  #if defined STM32F1
    #define UARTC_IO_AF           IO_AF_DEFAULT
  #elif defined STM32F7
    #define UARTC_IO_AF           IO_AF_8
  #elif defined STM32G4
    #define UARTC_IO_AF           IO_AF_5
  #elif defined STM32H5_H56x
    #define UARTC_IO_AF           IO_AF_8
  #endif
  #define UARTC_IRQn              UART4_IRQn
  #define UARTC_IRQHandler        UART4_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
    #warning UARTC IO_AF & DMA for F3 still TODO
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32WL
    #error UART4 NOT AVAILABLE !
  #elif defined STM32F0
    #undef UARTC_IRQn
    #undef UARTC_IRQHandler
    #define UARTC_IRQn            USART3_4_IRQn
    #define UARTC_IRQHandler      USART3_4_IRQHandler
  #elif defined STM32H5
    // H56x has UART4 on PA0/PA1 and PC10/PC11, both AF8 and bonded up to LQFP64
    #if !defined STM32H5_H56x
      #error UART4 NOT AVAILABLE on STM32H503 !
    #endif
  #endif

#elif defined UARTC_USE_UART5 || defined UARTC_USE_UART5_PC12PD2
  #define UARTC_UARTx             UART5
  #ifdef UARTC_USE_UART5
    // user needs to specify UARTC_USE_TX_IO, UARTC_USE_RX_IO, and possibly UARTC_USE_IO_AF
  #elif defined UARTC_USE_UART5_PC12PD2
    #define UARTC_TX_IO           IO_PC12
    #define UARTC_RX_IO           IO_PD2
  #endif
  #define UARTC_IRQn              UART5_IRQn
  #define UARTC_IRQHandler        UART5_IRQHandler
  #if defined STM32F1
    #define UARTC_IO_AF           IO_AF_DEFAULT
  #elif defined STM32F3
    #warning UARTC IO_AF & DMA for F3 still TODO //TODO
  #elif defined STM32F7
    #define UARTC_IO_AF           IO_AF_8
  #elif defined STM32G4
    #define UARTC_IO_AF           IO_AF_5
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32WL
    #error UART5 NOT AVAILABLE !
  #elif defined STM32H5
    // H56x has UART5 on PC12/PD2, AF8 and bonded up to LQFP64
    #if defined STM32H5_H56x
      #define UARTC_IO_AF         IO_AF_8
    #else
      #error UART5 NOT AVAILABLE on STM32H503 !
    #endif
  #endif

#elif defined UARTC_USE_UART6 || defined UARTC_USE_UART6_PC6PC7 || defined UARTC_USE_UART6_PG14PG9
  #define UARTC_UARTx             USART6
  #ifdef UARTC_USE_UART6
    // user needs to specify UARTC_USE_TX_IO, UARTC_USE_RX_IO, and possibly UARTC_USE_IO_AF
  #elif defined UARTC_USE_UART6_PC6PC7
    #define UARTC_TX_IO           IO_PC6
    #define UARTC_RX_IO           IO_PC7
  #elif defined UARTC_USE_UART6_PG14PG9 // was UART6_REMAPPED
    #define UARTC_TX_IO           IO_PG14
    #define UARTC_RX_IO           IO_PG9
  #endif
  #define UARTC_IO_AF             IO_AF_8
  #define UARTC_IRQn              USART6_IRQn
  #define UARTC_IRQHandler        USART6_IRQHandler

  #if defined STM32F1 || defined STM32F3 || defined STM32G4 || defined STM32WL
    #error UART6 NOT AVAILABLE !
  #elif defined STM32F7
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32H5
    // H56x USART6 is AF7, not AF8, and only PC6/PC7 is bonded up to LQFP64
    #if !defined STM32H5_H56x
      #error UART6 NOT AVAILABLE on STM32H503 !
    #elif defined UARTC_USE_UART6_PG14PG9
      #error UARTC_USE_UART6_PG14PG9 not bonded on STM32H56x packages up to LQFP64 ! use UARTC_USE_UART6_PC6PC7
    #else
      #undef UARTC_IO_AF
      #define UARTC_IO_AF         IO_AF_7
    #endif
  #endif

#elif defined UARTC_USE_UART7 || defined UARTC_USE_UART7_PE8PE7 || defined UARTC_USE_UART7_PF7PF6 || \
      defined UARTC_USE_UART7_PB4PB3 || defined UARTC_USE_UART7_PA15PA8
  #define UARTC_UARTx             UART7
  #ifdef UARTC_USE_UART7
    // user needs to specify UARTC_USE_TX_IO, UARTC_USE_RX_IO, and possibly UARTC_USE_IO_AF
  #elif defined UARTC_USE_UART7_PE8PE7
    #define UARTC_TX_IO           IO_PE8
    #define UARTC_RX_IO           IO_PE7
  #elif defined UARTC_USE_UART7_PF7PF6 // was UART7_REMAPPED
    #define UARTC_TX_IO           IO_PF7
    #define UARTC_RX_IO           IO_PF6
  #elif defined UARTC_USE_UART7_PB4PB3 // only H56x
    #define UARTC_TX_IO           IO_PB4
    #define UARTC_RX_IO           IO_PB3
  #elif defined UARTC_USE_UART7_PA15PA8 // only H56x // ATTENTION: PA15 is JTDI
    #define UARTC_TX_IO           IO_PA15
    #define UARTC_RX_IO           IO_PA8
  #endif
  #define UARTC_IO_AF             IO_AF_8
  #define UARTC_IRQn              UART7_IRQn
  #define UARTC_IRQHandler        UART7_IRQHandler

  #if defined STM32F1 || defined STM32F3 || defined STM32G4 || defined STM32WL
    #error UART7 NOT AVAILABLE !
  #elif defined STM32F7
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32H5
    // H56x UART7 is AF11, not AF8, and only PB4/PB3 and PA15/PA8 are bonded up to LQFP64
    #if !defined STM32H5_H56x
      #error UART7 NOT AVAILABLE on STM32H503 !
    #elif defined UARTC_USE_UART7_PE8PE7 || defined UARTC_USE_UART7_PF7PF6
      #error UARTC_USE_UART7 mapping not bonded on STM32H56x packages up to LQFP64 ! use UARTC_USE_UART7_PB4PB3 or UARTC_USE_UART7_PA15PA8
    #else
      #undef UARTC_IO_AF
      #define UARTC_IO_AF         IO_AF_11
    #endif
  #endif

#elif defined UARTC_USE_UART8 || defined UARTC_USE_UART8_PE1PE0
  #define UARTC_UARTx             UART8
  #ifdef UARTC_USE_UART8
    // user needs to specify UARTC_USE_TX_IO, UARTC_USE_RX_IO, and possibly UARTC_USE_IO_AF
  #elif defined UARTC_USE_UART8_PE1PE0
    #define UARTC_TX_IO           IO_PE1
    #define UARTC_RX_IO           IO_PE0
  #endif
  #define UARTC_IO_AF             IO_AF_8
  #define UARTC_IRQn              UART8_IRQn
  #define UARTC_IRQHandler        UART8_IRQHandler

